# 原始数据，以字符串形式呈现
data_str1 = [
'(65) (0) (4) (0) (0) (0) (0) (0) (0) (0) (0) (0) (5f) (70) (79) (63) (6f) (6d) (6d) (5f) (0) (0) (0) (0) (1) (0) (0) (0) ',
'(6f) (0) (24) (0) (1) (0) (0) (0) (0) (0) (0) (0) (5f) (70) (79) (63) (6f) (6d) (6d) (5f) (0) (0) (0) (0) (0) (0) (0) (0) (a) (0) (2) (0) (0) (0) (0) (0) (b2) (0) (14) (0) (52) (2) (20) (6) (24) (1) (a) (5) (8) (0) (e) (3) (20) (93) (24) (29) (30) (9) (0) (0) ',
'(66) (0) (0) (0) (1) (0) (0) (0) (0) (0) (0) (0) (5f) (70) (79) (63) (6f) (6d) (6d) (5f) (0) (0) (0) (0) ',
'(63) (0) (0) (0) (1) (0) (0) (0) (0) (0) (0) (0) (5f) (70) (79) (63) (6f) (6d) (6d) (5f) (0) (0) (0) (0) ',
]
for data_str in data_str1:
    # 去除括号和换行符，并按空格分割成单个元素
    cleaned_data = data_str.replace("(", "").replace(")", "").replace("\n", " ").split()

    # 初始化一个空字符串用于存储最终的十六进制字符串
    hex_string = ""

    # 遍历每个元素并转换为十六进制字符串
    for item in cleaned_data:
        # 将元素转换为整数，再转换为两位的十六进制字符串
        hex_string += "{:02x}".format(int(item, 16))

    print(hex_string)